app/views/welcome/user_profile.html.erb

SELECT "reservations".* FROM "reservations"  WHERE "reservations"."user_id" = ? AND (arrival_date <= '2014-12-03')  [["user_id", 1]]
---
        	<!-- Loop through here to fill table -->
			<% current_user.reservations.where('arrival_date <= ?', Date.today).each do |reservation| %>

SELECT  1 AS one FROM "reviews"  WHERE "reviews"."user_id" = ? AND "reviews"."hotel_id" = 253795 LIMIT 1  [["user_id", 1]]
---
                <td><%= reservation.departure_date.to_formatted_s(:long_ordinal) %></td>
				<% if current_user.reviews.exists?(:hotel_id => reservation.hotel_id) %>