app/views/reservations/modifyreservation.html.erb

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."user_id" = ? AND "reservations"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
---
        <tbody>
			<% @reservation = current_user.reservations.find(params[:id]) %>