app/views/reservations/payment.html.erb

SELECT  "payment_infos".* FROM "payment_infos"  WHERE "payment_infos"."user_id" = ? LIMIT 1  [["user_id", 1]]
---

<% if current_user.payment_info.blank? == false %>