app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("arrival_date", "created_at", "departure_date", "hotel_id", "hotel_name", "rate", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = current_user
    @reservation = @user.reservations.create(:hotel_id => $id,
                                             :hotel_name => $name,
                                             :arrival_date => $arrival,
                                             :departure_date => $departure,
                                             :rate => $rate
                                            )

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."user_id" = ? AND "reservations"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
UPDATE "reservations" SET "arrival_date" = ?, "departure_date" = ?, "updated_at" = ? WHERE "reservations"."id" = 3  [["arrival_date", "2014-12-19"], ["departure_date", "2014-12-22"], ["updated_at", "2014-12-04 01:21:44.623267"]]
---
  def update
    @reservation = current_user.reservations.find(params[:id])
    @reservation.arrival_date = Date.new(params[:arrival_date][:year].to_i, params[:arrival_date][:month].to_i, params[:arrival_date][:day].to_i)
    @reservation.departure_date = Date.new(params[:departure_date][:year].to_i, params[:departure_date][:month].to_i, params[:departure_date][:day].to_i)
    @reservation.save

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."user_id" = ? AND "reservations"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 2]]
---
  def delete
    @reservation = current_user.reservations.find(params[:id])
    @reservation.destroy