app/views/database/getList.html.erb

SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."hotel_id" = 131110
---
								&nbsp; &nbsp; Rating: <%= @hotelList[i].hotelRating %>
								&nbsp; &nbsp; <%=Review.where(:hotel_id => @hotelList[i].hotelId).count %> Review(s)