app/views/database/hotelInfo.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."hotel_id" = 131110
---
      <!-- Review -->
      <% Review.where(:hotel_id => @hotel.hotelId).each do |review| %>